
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.УчетнаяПолитика.Записывать = Истина;
	Движение = Движения.УчетнаяПолитика.Добавить();
	Движение.Период = Дата;
	Движение.СпособУчетаЗапасов = СпособСписанияЗапасов;
	
	ПредыдущаяПолитика = РегистрыСведений.УчетнаяПолитика.ПолучитьПоследнее(Дата);
	
	Если СпособСписанияЗапасов = Перечисления.СпособыСписанияЗапасов.ПоСредней И ПредыдущаяПолитика.УчетнаяПолитика = Перечисления.СпособыСписанияЗапасов.FEFO Тогда 

    Движения.ТоварыНаСкладах.Записывать = Истина; 
    Движения.ТоварыНаСкладах.Записать();

    Запрос = Новый Запрос; 
    Запрос.Текст =
    "ВЫБРАТЬ
    |    ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
    |    ТоварыНаСкладахОстатки.Склад КАК Склад,
    |    ТоварыНаСкладахОстатки.СрокГодности КАК СрокГодности,
    |    СУММА(ТоварыНаСкладахОстатки.КоличествоОстаток) КАК Количество,
    |    СУММА(ТоварыНаСкладахОстатки.СуммаОстаток) КАК Сумма
    |ИЗ
	|    РегистрНакопления.ТоварыНаСкладах.Остатки(&МоментИтогов, ) КАК ТоварыНаСкладахОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|   ТоварыНаСкладахОстатки.Номенклатура,
	|   ТоварыНаСкладахОстатки.Склад,
	|   ТоварыНаСкладахОстатки.СрокГодности
	|ИТОГИ
	|	СУММА(Количество)
	|ПО
	|	Номенклатура";
	
    Запрос.УстановитьПараметр("МоментИтогов", Новый Граница(МоментВремени())); 

    Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
    Пока Выборка.Следующий() Цикл
        Движение = Движения.ТоварыНаСкладах.ДобавитьРасход(); 
        Движение.Период = Дата;
        ЗаполнитьЗначенияСвойств(Движение, Выборка);

    Движение = Движения.ТоварыНаСкладах.ДобавитьПриход(); 
    Движение.Период = Дата;
    ЗаполнитьЗначенияСвойств(Движение, Выборка,,"СрокГодности");

    КонецЦикла;
КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) 
	
	Если НЕ ЗначениеЗаполнено(Ответственный) тогда
		Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;      
	
КонецПроцедуры

