
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказНаряд") Тогда

		Автомобиль = ДанныеЗаполнения.Автомобиль;
		Контрагент = ДанныеЗаполнения.Клиент;
		Сотрудник = ДанныеЗаполнения.Сотрудник;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		Комментарий = "Введен на основании: Заказ-наряд №" + ДанныеЗаполнения.Номер + " от " + Формат(ДанныеЗаполнения.Дата, "ДФ=dd.MM.yyyy");
		СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;
		Для Каждого ТекСтрокаМатериалыЗаказчика Из ДанныеЗаполнения.МатериалыЗаказчика Цикл
			НоваяСтрока = МатериалыЗаказчика.Добавить();
			НоваяСтрока.Количество = ТекСтрокаМатериалыЗаказчика.Количество;
			НоваяСтрока.Номенклатура = ТекСтрокаМатериалыЗаказчика.Номенклатура;
			НоваяСтрока.СостояниеМатериала = ТекСтрокаМатериалыЗаказчика.СостояниеМатериала;
		КонецЦикла;
		Для Каждого ТекСтрокаУслуги Из ДанныеЗаполнения.Услуги Цикл
			НоваяСтрока = Услуги.Добавить();
			НоваяСтрока.Количество = ТекСтрокаУслуги.Количество;
			НоваяСтрока.Сумма = ТекСтрокаУслуги.Сумма;
			НоваяСтрока.Услуга = ТекСтрокаУслуги.Услуга;
			НоваяСтрока.Цена = ТекСтрокаУслуги.Цена;
		КонецЦикла;
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(Ответственный) тогда
		Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ТоварыНаСкладах.Записывать 	= Истина;
	Движения.Продажи.Записывать 			= Истина;
	Движения.УчетЗатрат.Записывать 			= Истина;
	Движения.ЗаказыКлиентов.Записывать 		= Истина;
	Движения.МатериалыЗаказчиков.Записывать = Истина;
	Движения.Хозрасчетный.Записывать    	= Истина;
	
	Движения.ТоварыНаСкладах.Записать();
	Движения.Продажи.Записать();
	Движения.УчетЗатрат.Записать();  
	Движения.МатериалыЗаказчиков.Записать();
	 
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|    РеализацияТовары.Номенклатура КАК Номенклатура,
	|    Реализация.Склад КАК Склад,
	|    СУММА(РеализацияТовары.Количество) КАК Количество,
	|    СУММА(РеализацияТовары.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|    Документ.Реализация КАК Реализация
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Реализация.Товары КАК РеализацияТовары
	|		ПО РеализацияТовары.Ссылка = Реализация.Ссылка
	|ГДЕ
	|    РеализацияТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|    РеализацияТовары.Номенклатура,
	|    Реализация.Склад
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|    РеализацияУслуги.Услуга КАК Номенклатура,
	|    NULL,
	|	 NULL,
	|    СУММА(РеализацияУслуги.Цена)
	|ИЗ
	|    Документ.Реализация.Услуги КАК РеализацияУслуги
	|ГДЕ
	|    РеализацияУслуги.Ссылка = &Ссылка
	| СГРУППИРОВАТЬ ПО
	|       РеализацияУслуги.Услуга
	|
	|ИНДЕКСИРОВАТЬ ПО
	|    Номенклатура,
	|    Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|    ВТ_Товары.Номенклатура КАК Номенклатура,
	|    ВЫБОР
	|        КОГДА ВТ_Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|            ТОГДА ЛОЖЬ
	|        ИНАЧЕ ИСТИНА
	|    КОНЕЦ КАК ЭтоТовар,
	|    ВТ_Товары.Номенклатура.Представление КАК НоменклатураПредставление,
	|    ВТ_Товары.Количество КАК КоличествоВДокументе,
	|    ВТ_Товары.Сумма КАК СуммаВДокументе,
	|    ВТ_Товары.Склад КАК Склад,
	|    ЕСТЬNULL(ТоварыНаСкладахОстатки.СрокГодности, ДАТАВРЕМЯ(1, 1, 1)) КАК СрокГодности,
	|    ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
	|    ЕСТЬNULL(ТоварыНаСкладахОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
	|    ВТ_Товары.Номенклатура.СтатьяЗатрат КАК СтатьяЗатрат,
	|	 ВТ_Товары.Номенклатура.СчетБухгалтерскогоУчета КАК СчетБухгалтерскогоУчета
	|ИЗ
	|    ВТ_Товары КАК ВТ_Товары
	|        ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	|                &МоментВремени,
	|                (Номенклатура, Склад) В
	|                    (ВЫБРАТЬ
	|                        ВТ_Товары.Номенклатура,
	|                        ВТ_Товары.Склад
	|                    ИЗ
	|                        ВТ_Товары КАК ВТ_Товары)) КАК ТоварыНаСкладахОстатки
	|        ПО ВТ_Товары.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
	|                И ВТ_Товары.Склад = ТоварыНаСкладахОстатки.Склад
	|
	|УПОРЯДОЧИТЬ ПО
	|    ТоварыНаСкладахОстатки.СрокГодности
	|ИТОГИ
	|    МАКСИМУМ(КоличествоВДокументе),
	|    МАКСИМУМ(СуммаВДокументе),
	|    СУММА(КоличествоОстаток)
	|ПО
	|    Номенклатура";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(МоментВремени()));        
		
	ВыборкаНоменклатура = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаНоменклатура.Следующий() Цикл
		Если ВыборкаНоменклатура.ЭтоТовар Тогда 
			
			СтоимостьОбщая = 0; 
			ОсталосьСписать = ВыборкаНоменклатура.КоличествоВДокументе;
			Превышение = ОсталосьСписать - ВыборкаНоменклатура.КоличествоОстаток;
					
			Если (Превышение > 0) Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("Превышение остатка по номенклатуре ""%1""  в количестве ""%2""", ВыборкаНоменклатура.НоменклатураПредставление, Превышение);
				Сообщение.Сообщить();
				Отказ = Истина;
			КонецЕсли;	
				
			Если Отказ Тогда
				Продолжить;
			КонецЕсли;
			
			ВыборкаДетальные = ВыборкаНоменклатура.Выбрать();
			Пока ВыборкаДетальные.Следующий() И ОсталосьСписать > 0 Цикл 
				
				Если ВыборкаДетальные.КоличествоОстаток <= 0 Тогда
					Продолжить
				КонецЕсли;
				
				Списываем = Мин(ВыборкаДетальные.КоличествоОстаток, ОсталосьСписать);			
				
				Движение = Движения.ТоварыНаСкладах.ДобавитьРасход();
				Движение.Период = Дата;
				Движение.Номенклатура = ВыборкаДетальные.Номенклатура;
				Движение.Склад = ВыборкаДетальные.Склад;
				Движение.Количество = Списываем;
				Движение.СрокГодности = ВыборкаДетальные.СрокГодности; 
				
				Если Списываем = ВыборкаДетальные.КоличествоОстаток Тогда 
					Движение.Сумма = ВыборкаДетальные.СуммаОстаток;
				Иначе
					Движение.Сумма = Списываем / ВыборкаДетальные.КоличествоОстаток * ВыборкаДетальные.СуммаОстаток;
				КонецЕсли;
				
				ОсталосьСписать = ОсталосьСписать - Списываем; 
				СтоимостьОбщая = СтоимостьОбщая + Движение.Сумма;
				
				Движение = Движения.Хозрасчетный.Добавить();
				Движение.СчетДт = ПланыСчетов.Хозрасчетный.Продажи;
				Движение.СчетКт = ВыборкаНоменклатура.СчетБухгалтерскогоУчета;
				Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура] = ВыборкаДетальные.Номенклатура; 
				Движение.Период = Дата;    
				Движение.Сумма = СтоимостьОбщая;
				Движение.Содержание = "Списана себестоимость товарно-материальных ценностей";
				
			КонецЦикла;
			
			Движение = Движения.УчетЗатрат.Добавить(); 
			Движение.Период = Дата;
			Движение.СтатьяЗатрат = ВыборкаНоменклатура.СтатьяЗатрат;
			Движение.Сумма = СтоимостьОбщая;
			
		КонецЕсли;			
		
		Движение = Движения.Продажи.Добавить(); 
		Движение.Период = Дата;
		Движение.Номенклатура = ВыборкаНоменклатура.Номенклатура;
		Движение.Сотрудник = Сотрудник;
		Движение.Контрагент = Контрагент;
		Движение.Сумма = ВыборкаНоменклатура.СуммаВДокументе;
		
	КонецЦикла;
	
	Движение = Движения.Хозрасчетный.Добавить();
	Движение.СчетДт = ПланыСчетов.Хозрасчетный.РасчетыСПокупателями;
	Движение.СчетКт = ПланыСчетов.Хозрасчетный.Продажи;
	БухгалтерскийУчет.ЗаполнитьСубконтоПоСчету(Движение.СчетДт, Движение.СубконтоДт, Контрагент);
	Движение.Период = Дата;
	Движение.Сумма = СуммаДокумента;
	Движение.Содержание = "Отражена выручка от реализации товаров и услуг";
	
	Если ЗначениеЗаполнено(ЭтотОбъект.ДокументОснование) И ТипЗнч(ЭтотОбъект.ДокументОснование) = Тип("ДокументСсылка.ЗаказНаряд") Тогда
		Движение = Движения.ЗаказыКлиентов.Добавить(); 
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Клиент = Контрагент;
		Движение.ЗаказКлиента = ДокументОснование;
		Движение.Сумма = Услуги.Итог("Сумма");
	КонецЕсли;
	
	Для Каждого ТекСтрокаМатериалыЗаказчиков из МатериалыЗаказчика цикл
		Движение = Движения.МатериалыЗаказчиков.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Склад = Склад;
		Движение.Заказчик = Контрагент;
		Движение.Номенклатура = ТекСтрокаМатериалыЗаказчиков.Номенклатура;
		Движение.Количество = ТекСтрокаМатериалыЗаказчиков.Количество;
	КонецЦикла;	

	
КонецПроцедуры

