
Функция getUserGET(Запрос)
	
	Логин = Строка(Запрос.ПараметрыЗапроса.Получить("username")); 
	
	Если Логин = "" Тогда
		Ответ = Новый HTTPСервисОтвет(400);
		Ответ.УстановитьТелоИзСтроки("Ошибка.");
		Возврат Ответ;
	КонецЕсли;
	
	ЗапросПользователи = Новый Запрос;
	
	ЗапросПользователи.Текст = "ВЫБРАТЬ
	|    УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Пользователи.Ссылка) КАК Ссылка,
	|    Пользователи.Наименование КАК Наименование,
	|    Пользователи.Код КАК Код
	|ИЗ
	|    Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|    НЕ Пользователи.ПометкаУдаления
	|    И Пользователи.Наименование = &Наименование";
	
	ЗапросПользователи.УстановитьПараметр("Наименование", Логин); 
	
	РезультатЗапроса = ЗапросПользователи.Выполнить(); 	
	Выборка = РезультатЗапроса.Выбрать();   	
	
	Если Не Выборка.Следующий() Тогда
		Ответ = Новый HTTPСервисОтвет(404);
		Ответ.УстановитьТелоИзСтроки("Не найден.");
		Возврат Ответ;
	КонецЕсли;
	
	ДанныеПользователя = Новый Структура; 
	ДанныеПользователя.Вставить("name", Строка(Выборка.Наименование));
	ДанныеПользователя.Вставить("code", Строка(Выборка.Код));
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, ДанныеПользователя);
	СтрокаОтвета = ЗаписьJSON.Закрыть();
	
	Ответ = Новый HTTPСервисОтвет(200); 
	Ответ.УстановитьТелоИзСтроки(СтрокаОтвета); 
	
	Возврат Ответ; 
	
КонецФункции
