
Процедура ПередЗаписью(Отказ)
	
	Если не ЭтотОбъект.ЭтоГруппа Тогда
		Родитель = ЭтотОбъект.Родитель;
		ПустаяСсылка = Справочники.Номенклатура.ПустаяСсылка();
		
		Если Родитель = ПустаяСсылка тогда
			Отказ = Истина;
			Сообщить("Неверная группа");
			Возврат;
		КонецЕсли;	
		
		Если Родитель = Справочники.Номенклатура.Услуги Тогда
			Если ЭтотОбъект.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Услуга Тогда
				Отказ = Истина;
				Сообщить("Неверная группа");
				Возврат;
			КонецЕсли;
		ИначеЕсли Родитель = Справочники.Номенклатура.Товары Тогда
			Если ЭтотОбъект.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Товар Тогда
				Отказ = Истина;
				Сообщить("Неверная группа");
				Возврат;
			КонецЕсли;
		ИначеЕсли Родитель = Справочники.Номенклатура.Материалы Тогда
			Если ЭтотОбъект.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Материал Тогда
				Отказ = Истина;
				Сообщить("Неверная группа");
				Возврат;
			КонецЕсли;
		ИначеЕсли Родитель = Справочники.Номенклатура.МатериалыКлиента Тогда
			Если ЭтотОбъект.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.МатериалКлиента Тогда
				Отказ = Истина;
				Сообщить("Неверная группа");
				Возврат;
			КонецЕсли;				
		КонецЕсли;		
	КонецЕсли; 
	
КонецПроцедуры


