
&НаКлиенте
Процедура УстановитьВидимость()
	
	ЭтоОплатаОтПокупателя         = (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступленияДенег.ОплатаОтПокупателя"));
	ЭтоВозвратОтПоставщика        = (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступленияДенег.ВозвратОтПоставщика"));
	ЭтоВозвратОтПодотчетника      = (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступленияДенег.ВозвратОтПодотчетника"));
	    
    КонтрагентПокупатель = КонтрагентПокупатель(Объект.Плательщик); 
	Элементы.Договор.Видимость    = (ЭтоВозвратОтПоставщика или ЭтоОплатаОтПокупателя) и не КонтрагентПокупатель;	
	
	СтрокаТипПолучателя = "СправочникСсылка.Сотрудники";
    Если НЕ ЭтоВозвратОтПодотчетника Тогда
        СтрокаТипПолучателя = "СправочникСсылка.Контрагенты";
    КонецЕсли;
    
    Массив = Новый Массив();
    Массив.Добавить(Тип(СтрокаТипПолучателя));
    
    ОписаниеТипаПолучателя = Новый ОписаниеТипов(Массив);
    Элементы.Плательщик.ОграничениеТипа = ОписаниеТипаПолучателя;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция КонтрагентПокупатель(КонтрагентСсылка)  

		Запрос = Новый Запрос;  
		Запрос.УстановитьПараметр("КонтрагентСсылка", КонтрагентСсылка);
		Запрос.УстановитьПараметр("ТипКонтрагентаПокупатель", Перечисления.ТипыКонтрагентов.Покупатель);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|    Контрагенты.Ссылка КАК Контрагент
		|ИЗ
		|    Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|    Контрагенты.Ссылка = &КонтрагентСсылка
		|    И Контрагенты.ТипКонтрагента = &ТипКонтрагентаПокупатель";
		
		Результат = Запрос.Выполнить();
		
		Возврат НЕ Результат.Пустой();
					
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)  
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	УстановитьВидимость();

КонецПроцедуры

&НаКлиенте
Процедура ПлательщикПриИзменении(Элемент) 
	
	УстановитьВидимость(); 
	
КонецПроцедуры                   


