
Функция registrUserGET(Запрос) 
	    
    Логин = Строка(Запрос.ПараметрыЗапроса.Получить("username"));
    Телефон = Строка(Запрос.ПараметрыЗапроса.Получить("phone"));
        	
    СуществующийПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(Логин);
    Если СуществующийПользовательИБ <> Неопределено Тогда
            Ответ = Новый HTTPСервисОтвет(400);
    		Ответ.УстановитьТелоИзСтроки("Ошибка.");
    		Возврат Ответ;
    КонецЕсли;
    
    НовыйПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
    НовыйПользовательИБ.Имя = Логин;
    НовыйПользовательИБ.ПолноеИмя = Логин;
    НовыйПользовательИБ.Пароль = Логин;
    
    НовыйПользовательИБ.Роли.Добавить(Метаданные.Роли.ПолныеПрава);
    НовыйПользовательИБ.Записать();
    
    УИДПользователя = НовыйПользовательИБ.УникальныйИдентификатор;
    
    НовыйКонтрагент = Справочники.Контрагенты.СоздатьЭлемент();
	НовыйКонтрагент.Родитель = Справочники.Контрагенты.НайтиПоНаименованию("Покупатели"); 
    НовыйКонтрагент.Наименование = Логин;  
	НовыйКонтрагент.КонтактныйТелефон = Телефон; 
    НовыйКонтрагент.Комментарий = "Контрагент зарегистрирован через мобильное приложение";
    НовыйКонтрагент.ТипКонтрагента = ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.Покупатель");
    НовыйКонтрагент.Записать();
      
    НовыйПользовательСпр = Справочники.Пользователи.СоздатьЭлемент();
    НовыйПользовательСпр.Наименование = Логин;  
	НовыйПользовательСпр.Код = Строка(УИДПользователя);  
    НовыйПользовательСпр.Клиент = НовыйКонтрагент.Ссылка;  
    НовыйПользовательСпр.Записать();
    	
    ДанныеПользователя = Новый Структура;
    ДанныеПользователя.Вставить("name", Логин);     
	ДанныеПользователя.Вставить("code", Строка(УИДПользователя));   
	ДанныеПользователя.Вставить("phone", Телефон);   
    ДанныеПользователя.Вставить("userId", Строка(УИДПользователя));  
	
    ЗаписьJSON = Новый ЗаписьJSON;
    ЗаписьJSON.УстановитьСтроку();
    ЗаписатьJSON(ЗаписьJSON, ДанныеПользователя);
    СтрокаОтвета = ЗаписьJSON.Закрыть();
	
	Ответ = Новый HTTPСервисОтвет(200); 
	Ответ.УстановитьТелоИзСтроки(СтрокаОтвета);
	
    Возврат Ответ;
    
КонецФункции
