
Функция createOrderPOST(Запрос) 
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Запрос.ПолучитьТелоКакСтроку());
	ДанныеЗапроса = ПрочитатьJSON(ЧтениеJSON, Ложь);
	ЧтениеJSON.Закрыть();
	
	ЗапросПоиска = Новый Запрос;
	ЗапросПоиска.Текст = "ВЫБРАТЬ
	|	Пользователи.Ссылка КАК Ссылка,
	|	Пользователи.Клиент КАК Клиент
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.Код = &ВнешнийGUID";
	ЗапросПоиска.УстановитьПараметр("ВнешнийGUID", ДанныеЗапроса.GUIDПользователя);
	РезультатПоиска = ЗапросПоиска.Выполнить();
		
		Если Не РезультатПоиска.Пустой() Тогда
			Выборка = РезультатПоиска.Выбрать();
			Выборка.Следующий();
			НайденныйПользователь = Выборка.Ссылка;
		КонецЕсли;
	
	Если НайденныйПользователь = Справочники.Пользователи.ПустаяСсылка() Тогда
		Ответ = Новый HTTPСервисОтвет(400);
		ТекстОшибки = "Пользователь с GUID " + ДанныеЗапроса.GUIDПользователя + " не найден в справочнике Пользователи";
		Ответ.УстановитьТелоИзСтроки(ТекстОшибки);
		Возврат Ответ;
	КонецЕсли;
	
	НоваяЗапись = Документы.ЗаказНаряд.СоздатьДокумент();
	НоваяЗапись.Сотрудник = Справочники.Сотрудники.НайтиПоНаименованию(ДанныеЗапроса.Сотрудник);
	НоваяЗапись.Клиент = НайденныйПользователь.Клиент;
	НоваяЗапись.Дата = ТекущаяДата();
	НоваяЗапись.ДатаЗаписи = ПрочитатьДатуJSON(ДанныеЗапроса.ДатаЗаписи, ФорматДатыJSON.ISO);
	НоваяЗапись.СуммаДокумента = 0; 
	НоваяЗапись.Комментарий = "Заказ-наряд создан через мобильное приложение";
	Для Каждого СтруктураУслуги Из ДанныеЗапроса.МассивУслуг Цикл
		НоваяУслуга = НоваяЗапись.Услуги.Добавить();
		НоваяУслуга.Услуга  = Справочники.Номенклатура.НайтиПоНаименованию(СтруктураУслуги.Номенклатура);
		НоваяУслуга.Количество = Число(СтруктураУслуги.Количество);
		НоваяУслуга.Сумма = Число(СтруктураУслуги.Сумма);
		НоваяУслуга.Цена = СтруктураУслуги.Сумма / СтруктураУслуги.Количество;
		НоваяЗапись.СуммаДокумента = НоваяЗапись.СуммаДокумента + Число(СтруктураУслуги.Сумма);;
	КонецЦикла; 

	
	Попытка
		НоваяЗапись.Записать(РежимЗаписиДокумента.Проведение);
		ТекстОтвета = "Создан и проведен документ " + НоваяЗапись.Номер;
		Ответ = Новый HTTPСервисОтвет(200);
	Исключение
		НоваяЗапись.Записать();
		Ответ = Новый HTTPСервисОтвет(500);
		ТекстОтвета = "Произошла ошибка при проведении документа " + НоваяЗапись.Номер + "! ";
	КонецПопытки;
	
	Ответ.УстановитьТелоИзСтроки(ТекстОтвета);
	
	Возврат Ответ; 
	
КонецФункции
