 
 Процедура УстановкаПараметровСеанса(ИменаПараметровСеанса)
	 
	 ПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
	 
	 Если ПользовательИБ <> Неопределено Тогда
		 
		 НайденныйПользователь = Справочники.Пользователи.НайтиПоНаименованию(ПользовательИБ.Имя);
		 
		 Если НайденныйПользователь.Пустая() Тогда
			 НовыйПользователь = Справочники.Пользователи.СоздатьЭлемент();
			 НовыйПользователь.Наименование = ПользовательИБ.Имя;
			 Идентификатор = Строка(ПользовательИБ.УникальныйИдентификатор); 
			 ИдентификаторЧистый = Лев(Идентификатор, 36);
			 НовыйПользователь.Код = ИдентификаторЧистый;
			 НовыйПользователь.Записать();
			 НайденныйПользователь = НовыйПользователь.Ссылка;
		 КонецЕсли;
		 
		 ПараметрыСеанса.ТекущийПользователь = НайденныйПользователь;
		 
	 КонецЕсли;
	 
 КонецПроцедуры
