
&НаКлиенте
Процедура УстановитьВидимость()
	
	ЭтоВыдачаПодотчетнику         = (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходаДенег.ВыдачаПодотчетнику"));
	ЭтоВыдачаЗП			          = (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходаДенег.ВыдачаЗаработнойПлаты"));
	ЭтоОплатаПоставщику		      = (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходаДенег.ОплатаПоставщику"));
	ЭтоВозвратПокупателю	      = (Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходаДенег.ВозвратПокупателю"));
	    
	КонтрагентПокупатель		  = КонтрагентПокупатель(Объект.Получатель); 
	Элементы.Договор.Видимость    = (ЭтоОплатаПоставщику или ЭтоВозвратПокупателю) и не КонтрагентПокупатель; 
	
	СтрокаТипПолучателя = "СправочникСсылка.Контрагенты";
    Если ЭтоВыдачаПодотчетнику или ЭтоВыдачаЗП Тогда
        СтрокаТипПолучателя = "СправочникСсылка.Сотрудники";
    КонецЕсли;
    
    Массив = Новый Массив();
    Массив.Добавить(Тип(СтрокаТипПолучателя));
    
    ОписаниеТипаПолучателя = Новый ОписаниеТипов(Массив);
    Элементы.Получатель.ОграничениеТипа = ОписаниеТипаПолучателя;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция КонтрагентПокупатель(КонтрагентСсылка)  

		Запрос = Новый Запрос;  
		Запрос.УстановитьПараметр("КонтрагентСсылка", КонтрагентСсылка);
		Запрос.УстановитьПараметр("ТипКонтрагентаПокупатель", Перечисления.ТипыКонтрагентов.Покупатель);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|    Контрагенты.Ссылка КАК Контрагент
		|ИЗ
		|    Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|    Контрагенты.Ссылка = &КонтрагентСсылка
		|    И Контрагенты.ТипКонтрагента = &ТипКонтрагентаПокупатель";
		
		Результат = Запрос.Выполнить();
		
		Возврат НЕ Результат.Пустой();
					
КонецФункции

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)

	УстановитьВидимость();

КонецПроцедуры

&НаКлиенте
Процедура ПолучательПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	УстановитьВидимость();

КонецПроцедуры

