

Процедура ПередЗаписью(Отказ)
	
	 Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ИНН) Тогда
        Отказ = Истина;
        Сообщить("Заполните ИНН", СтатусСообщения.Важное);
        Возврат;
    КонецЕсли;
    
    ТипОрганизации = ЭтотОбъект.ТипОрганизации;     

	ДлинаИНН = СтрДлина(СокрЛП(ЭтотОбъект.ИНН));
    
    Если ТипОрганизации = ПредопределенноеЗначение("Перечисление.ТипыОрганизаций.ИндивидуальныйПредприниматель") Тогда
        Если ДлинаИНН <> 12 Тогда
            Отказ = Истина;
            Сообщить("Для ИП ИНН должен содержать 12 символов. Введено " + ДлинаИНН + ".", СтатусСообщения.Важное);
        КонецЕсли;
    ИначеЕсли ТипОрганизации = ПредопределенноеЗначение("Перечисление.ТипыОрганизаций.ЮридическоеЛицо") Тогда
        Если ДлинаИНН <> 10 Тогда
            Отказ = Истина;
            Сообщить("Для юридического лица ИНН должен содержать 10 символов. Введено " + ДлинаИНН + ".", СтатусСообщения.Важное);
		КонецЕсли;
	ИначеЕсли ДлинаИНН <> 10 или ДлинаИНН <> 12 тогда
		Отказ = Истина;
            Сообщить("Длина ИНН некорректна", СтатусСообщения.Важное);
	КонецЕсли;
		
	Если ЭтотОбъект.ТипОрганизации <> ПредопределенноеЗначение("Перечисление.ТипыОрганизаций.ЮридическоеЛицо") И 
		ЗначениеЗаполнено(ЭтотОбъект.ГлавныйБухгалтер) тогда
			ЭтотОбъект.ГлавныйБухгалтер = Справочники.Организации.ПустаяСсылка();
	КонецЕсли;		

КонецПроцедуры

