
&НаКлиенте
Процедура БессрочныйПриИзменении(Элемент)    
	
	Если Объект.Бессрочный = Истина тогда
		Элементы.ДатаОкончания.Видимость = Ложь;
	Иначе
		Элементы.ДатаОкончания.Видимость = Истина;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура НомерПриИзменении(Элемент)
	
	СформироватьНаименование();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	
	СформироватьНаименование();    
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьНаименование()
	
	Объект.Наименование = "№" + Объект.Номер + " от " + Формат(Объект.ДатаНачала, "ДФ=dd.MM.yyyy") + " г. ";
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.Бессрочный = Истина И ЗначениеЗаполнено(Объект.ДатаОкончания) тогда
		Объект.ДатаОкончания = '00010101';
	КонецЕсли;
	
КонецПроцедуры

