
&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	РаботаСТабличнымиЧастямиКлиент.ПересчитатьСуммуВСтрокеТабличнойЧасти(Элементы.Товары.ТекущиеДанные);
    ПересчитатьСуммуДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент) 
	
	РаботаСТабличнымиЧастямиКлиент.ПересчитатьСуммуВСтрокеТабличнойЧасти(Элементы.Товары.ТекущиеДанные);
    ПересчитатьСуммуДокумента(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент)
	
	ПересчитатьСуммуДокумента();  
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиУслугаПриИзменении(Элемент)
		
	СтрокаТЧ = Элементы.Услуги.ТекущиеДанные;
	СтрокаТЧ.СтатьяЗатрат = ПолучитьСтатьюЗатрат(СтрокаТЧ.Услуга);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтатьюЗатрат(Номенклатура)

 	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	        |	Номенклатура.СтатьяЗатрат КАК СтатьяЗатрат
	        |ИЗ
	        |	Справочник.Номенклатура КАК Номенклатура
	        |ГДЕ
	        |	Номенклатура.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Сообщить("В базе данных не найдена статья затрат");
		Возврат 0;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.СтатьяЗатрат; 
	
КонецФункции	

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент) 
	
	РаботаСТабличнымиЧастямиКлиент.ПересчитатьСуммуВСтрокеТабличнойЧасти(Элементы.Услуги.ТекущиеДанные);
    ПересчитатьСуммуДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент) 
	
	РаботаСТабличнымиЧастямиКлиент.ПересчитатьСуммуВСтрокеТабличнойЧасти(Элементы.Услуги.ТекущиеДанные);
    ПересчитатьСуммуДокумента();       
	
КонецПроцедуры


